Revit 2024 API
ExternalServices.BuiltInExternalServices.RevisionsOnSheetUIService Property
 The UI service which permits registration of an external server for new UI managing RevisionsOnSheet selection
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ExternalServiceId RevisionsOnSheetUIService { get; }
Visual Basic
Public Shared ReadOnly Property RevisionsOnSheetUIService As ExternalServiceId
	Get
Visual C++
public:
static property ExternalServiceId^ RevisionsOnSheetUIService {
	ExternalServiceId^ get ();
}
See Also
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace